[
  {
    "id": "9fe8e7b2-8a96-11e2-8d53-c6d0eb5a999d",
    "created_at": "Mon Mar 11 21:57:58 UTC 2013",
    "title": "Payments Engineer @ Meetup",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>We&rsquo;re starting a local community revolution! Our goal is a &ldquo;Meetup Everywhere about Most Everything&rdquo;, and we&rsquo;re on our way. We help people &ldquo;use the internet to get off the internet&rdquo; because Meetups change lives and can change the world.\u2028\u2028</p>\n\n<p>We are profitable, growing, and committed to building an all-star, all-NYC company. We are a company that values doers over talkers and mentors over managers. We are a company where people who take risks and win are rewarded and grow.\u2028</p>\n\n<p>Meetup is looking for the right engineer to own and advance the technology that is driving commerce on Meetup. Supporting existing billing and payments infrastructure is one part of the role; the other part is building new technology to expand and enhance the substantial commercial activity happening every day in the world&rsquo;s largest network of local community groups.</p>\n\n<p>What we are looking for:</p>\n\n<ul>\n<li>Experience with some of these: Java/Scala/Python/SQL</li>\n<li>Tremendous attention to detail and a proven ability to build reliable and flexible software</li>\n<li>An entrepreneurial, creative mindset</li>\n<li>Experience with HTML/CSS/Javascript preferred</li>\n<li>Prior experience working with billing and payments systems preferred</li>\n<li>A passion and desire to work at a company trying to change the world</li>\n</ul>\n\n<p>Our team is smart, ambitious, supportive, and above all &ndash; we are excited by what we do. While meeting regular deadlines and being focused on quick, quality completion of projects, the environment is relaxed and fun.    </p>\n\n<p>Every member of the Meetup Team is expected to: be an Innovator; be a Collaborator; be a Champion for their ideas; be an Expert; have High Standards;  be dedicated to the power of self-organized groups and our mission of A Meetup Everywhere About Most Everything (&ldquo;MEME&rdquo;);  and most importantly, Get Stuff Done That Makes a Difference!  </p>\n\n<p>Check out our dev blog: http://making.meetup.com/ </p>\n\n<p>And scenes from our latest hackathon: http://www.youtube.com/watch?v=ttEb0C-IPyA</p>\n",
    "how_to_apply": "<p>If the above describes you and what you&rsquo;re looking for, please send us your resume!</p>\n\n<p>To apply: <a href=\"http://hire.jobvite.com/j/?aj=oqmVWfwn&s=Github\">http://hire.jobvite.com/j/?aj=oqmVWfwn&amp;s=Github</a></p>\n",
    "company": "Meetup",
    "company_url": "http://www.meetup.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/7755aba0-8a96-11e2-9bb9-052fce13a9ca.jpg",
    "url": "http://jobs.github.com/positions/9fe8e7b2-8a96-11e2-8d53-c6d0eb5a999d"
  },
  {
    "id": "8eeb2e08-8a95-11e2-9f53-7b16911d0cd6",
    "created_at": "Mon Mar 11 21:50:06 UTC 2013",
    "title": "iOS Engineer @ Meetup",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>We&rsquo;re starting a local community revolution! Our goal is a &ldquo;Meetup Everywhere about Most Everything&rdquo;, and we&rsquo;re on our way. We help people &ldquo;use the internet to get off the internet&rdquo; because Meetups change lives and can change the world.</p>\n\n<p>\u2028\u2028We are profitable, growing, and committed to building an all-star, all-NYC company. We are a company that values doers over talkers and mentors over managers. We are a company where people who take risks and win are rewarded and grow.\u2028</p>\n\n<p>Meetup is looking for an exceptional iOS engineer to help us enrich the Meetup community through mobile applications. You should demonstrate experience on iOS by having taken apps from conception to launch. On Meetup’s mobile team, you&rsquo;ll invent new ways to revolutionize local community.</p>\n\n<p>Requirements:</p>\n\n<ul>\n<li>A love of what you do</li>\n<li>The idea of helping grow local community worldwide thrills you</li>\n<li>Demonstrated experience in engineering for iOS devices</li>\n<li>Core Data and Storyboards experience a plus</li>\n<li>Experience interacting with Web APIs</li>\n<li>Formal CS Degree a plus</li>\n</ul>\n\n<p>Our team is smart, ambitious, supportive, and above all &ndash; we are excited by what we do. While meeting regular deadlines and being focused on quick, quality completion of projects, the environment is relaxed and fun. </p>\n\n<p>Every member of the Meetup Team is expected to: be an Innovator; be a Collaborator; be a Champion for their ideas; be an Expert; have High Standards; be dedicated to the power of self-organized groups and our mission of A Meetup Everywhere About Most Everything (&ldquo;MEME&rdquo;); and most importantly, Get Stuff Done That Makes a Difference!</p>\n\n<p>Check out our dev blog: <a href=\"http://making.meetup.com/\">http://making.meetup.com/</a></p>\n\n<p>And scenes from our latest hackathon: <a href=\"http://www.youtube.com/watch?v=ttEb0C-IPyA\">http://www.youtube.com/watch?v=ttEb0C-IPyA</a></p>\n",
    "how_to_apply": "<p>If the above describes you and your passions, we&rsquo;d love to hear from you!</p>\n\n<p>To apply: <a href=\"http://hire.jobvite.com/j/?aj=oSkeXfw7&s=Github\">http://hire.jobvite.com/j/?aj=oSkeXfw7&amp;s=Github</a></p>\n",
    "company": "Meetup",
    "company_url": "http://www.meetup.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/83ef98ea-8a95-11e2-8fb3-5870ebe34d45.jpg",
    "url": "http://jobs.github.com/positions/8eeb2e08-8a95-11e2-9f53-7b16911d0cd6"
  },
  {
    "id": "bd98d3c0-8a8d-11e2-9b82-4386faeeabe1",
    "created_at": "Mon Mar 11 20:54:22 UTC 2013",
    "title": "Director, UI/UX, Music Products",
    "location": "New York, NY",
    "type": "Contract",
    "description": "<p>Reports to: VP, Product Development, Digital Music Group</p>\n\n<p>The Digital Music Strategy group oversees all digital music features and products across MTV, VH1, CMT, Logo, and their related brands. This includes large new initiatives such as artists.mtv, MTV Hive, and the O Music Awards, as well as the ongoing optimization of existing products and features across brands and platforms.. The Director, UI/UX will work closely with the group’s designers and product managers to create a unified approach to our user interface and visual design. </p>\n\n<p>This is a full-time freelance position based in New York City.</p>\n\n<p>RESPONSIBILITIES\n* Work closely with product, design, and engineering teams to build world-class interfaces for our digital music products. \n* Set visual design and interface guidelines that other team members can follow in their own work.\n* Work closely with other design teams within the larger organization to fit within their guidelines, while adapting to fit our users’ unique needs. \n* Help entire product, design, and engineering team to develop a user-centered design approach.\n* For all of these responsibilities, employ a data driven approach, building out minimum viable products to test interface hypotheses, and move forward only with validated concepts. </p>\n\n<p>REQUIREMENTS\n* Minimum of 7 years experience as a UI/UX professional or related field (e.g., product management or design in a start-up, technology company, leading consumer brand)\n* Experiences delivering style guides to a team of designers. \n* Experience giving design deliverables to a development team, including clearly labeled layered PSDs, and annotated mock-ups.\n* Ability to work in a fast-paced, high growth environment\n* Ability to work well across teams in a highly matrixed organization. \n* Excellent listening, writing, and presentation skills\n* Impeccable communication, and interpersonal skills\n* History of innovation and creativity; passion for and deep knowledge of music, technology, and brand building</p>\n",
    "how_to_apply": "<p>Email your resume and cover letter to artistplatformjobs@viacom.com.</p>\n",
    "company": "Viacom",
    "company_url": "http://www.viacom.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/bd98d3c0-8a8d-11e2-9b82-4386faeeabe1"
  },
  {
    "id": "e4506b0a-8a8c-11e2-8083-a51d30eb0ecd",
    "created_at": "Mon Mar 11 20:48:41 UTC 2013",
    "title": "Product Manager, Digital Music Group",
    "location": "New York, NY",
    "type": "Contract",
    "description": "<p>Reports to: VP, Product Development, Digital Music Group</p>\n\n<p>The Digital Music Strategy group oversees all digital music features and products across MTV, VH1, CMT, Logo, and their related brands. This includes new initiatives such as artists.mtv, MTV Hive, and the O Music Awards, as well as the ongoing optimization of existing products and features across brands and platforms. The Product Manger, Digital Music Strategy Group, will largely be responsible for the latter, as well as how all these products – new and old – interact with one another, ultimately resulting in a cohesive and awesome music experience across our portfolio of brands and platforms (web, mobile). </p>\n\n<p>This is a full-time freelance position based in New York City. </p>\n\n<p>RESPONSIBILITIES\n* Provide the single best music video viewing experience on the web, unifying the music video experience across Artists.MTV, MTV, VH1, and CMT. \n* Enhance already successful live streaming program, finding new ways for fans to interact with live concerts and festivals.\n* Work closely with editorial teams and other product groups to see how we can best showcase our various blogs (e.g. MTV Hive, RapFix) and news sources within the larger effort to showcase that editorial for all verticals (fashion, movies, etc). \n* Coordinate with CMT music and site teams to enhance already popular CMT Radio experience, bringing it to new platforms.\n* Bring all of these products together into unified music hubs for MTV, VH1, and CMT. \n* For all of these responsibilities, employ a data driven approach, building out minimum viable products to test product hypotheses, and move forward only with validated concepts. </p>\n\n<p>REQUIREMENTS\n* 5-7 years experience as a product manager in a start-up, media company, or leading consumer brand)\n* Ability to create clear and detailed annotated wireframes. \n* Ability to create detailed functional specifications\n* Experience managing a product backlog in JIRA, Asana, Basecamp, or a similar project tracking tool. \n* Excellent eye for design.\n* Ability to work in a fast-paced, high growth environment.\n* Ability to work well across teams in a highly matrixed organization. \n* Excellent listening, writing, and presentation skills.\n* Impeccable communication, and interpersonal skills.\n* History of innovation and creativity; passion for and deep knowledge of music, technology, and brand building.</p>\n",
    "how_to_apply": "<p>Email your resume and cover letter to artistplatformjobs@viacom.com.</p>\n",
    "company": "Viacom",
    "company_url": "http://www.viacom.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/e4506b0a-8a8c-11e2-8083-a51d30eb0ecd"
  },
  {
    "id": "64a61402-8769-11e2-9271-cdf60a23d812",
    "created_at": "Thu Mar 07 20:58:57 UTC 2013",
    "title": "Front End Engineer",
    "location": "Hoboken, NJ",
    "type": "Full Time",
    "description": "<p>Spreemo is health technology start-up looking for a talented front-end engineer to join the team. We are a young group of people solving interesting healthcare problems. We&rsquo;re open to new ideas and looking for individuals who want to make an impact at a growing company.</p>\n\n<p>Skills &amp; Requirements</p>\n\n<p>BS in computer science or related technical field.\n3+ years professional front-end engineering experience.</p>\n\n<p>Required</p>\n\n<p>Strong object-oriented programming experience with Python, Ruby, or PHP.\nFamiliarity with MVC frameworks like Django, Rails or Zend.\nStrong HTML, CSS, JS, and Ajax skills.\nExperience writing native, cross-browser JS and using JS libraries, like YUI or jQuery.\nExperience with RESTful web services.\nComfort with Unix based systems and TDD.</p>\n\n<p>Preferred</p>\n\n<p>Expert implementing beautiful, functional, cross-browser interfaces.\nExpert in Adobe Photoshop or Fireworks.\nKnowledge about server-side and client-side security and performance challenges.\nExperience with cloud computing platforms like Amazon Web Services or Google App Engine.\nFamiliarity with functional programming like Lisp, Scheme or Haskell.</p>\n\n<p>Benefits</p>\n\n<p>A flexible, challenging, fun team environment.\nCompany sponsored happy hours/lunches.\nPaid vacation time!\nOffice located 20 minutes from NYC on the Hoboken waterfront.\nHealth benefits.\nThe ability to grow your career and skill set.\nEmployee stock/equity plan.\nCompetitive compensation.</p>\n\n<p>Are you a passionate UI/UX Developer?</p>\n\n<p>You may absolutely hate Star Wars, on the off chance that you too love of Jedi Mind tricks and light-saber warfare almost as much as web development, I must ask&mdash; Do you dream of being a Jedi Master? Like the Yoda of all things Front End? If you are at all interested email amethyst.holder@spreemo.com and hone your skills from Front End Jedi Knight to Master. </p>\n\n<p>Share your background and let&rsquo;s get started (Bonus points if your name start with Sky and end in Walker).</p>\n",
    "how_to_apply": "<p>Email your resume and interests to amethyst.holder@spreemo.com</p>\n",
    "company": "Spreemo",
    "company_url": "http://www.spreemo.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/8f449f2c-8768-11e2-8e82-3035ce0307a4.PNG",
    "url": "http://jobs.github.com/positions/64a61402-8769-11e2-9271-cdf60a23d812"
  },
  {
    "id": "c4ddc64c-8734-11e2-8438-81ad52db3ef6",
    "created_at": "Thu Mar 07 14:40:08 UTC 2013",
    "title": "Web Developer",
    "location": "New York, New York",
    "type": "Full Time",
    "description": "<p>Front-End Web Developer:</p>\n\n<p>We&rsquo;re looking to hire a talented Front-End Web Developer. American Expres Publishing includes Travel + Leisure, Food &amp; Wine, and various other publications. You&rsquo;ll be working with bright individuals who have a passion for programming and submitting to open-source projects. Our culture is easy-going and much more akin to a startup.</p>\n\n<p>Perks:\n&ndash; Work at an established company that’s been around since 1850, profitable, and proud!\n&ndash; Join a thriving team of developers to help drive the product. Your input will be welcome.\n&ndash; Our team is test and spec driven. Nothing gets launched without a functioning test-suite, and are in the process of measuring as much as possible.\n&ndash; We actively encourage contributions back to the Open Source Community.\n&ndash; We provide training and tutoring, book and screencasts, and are more than willing to send developers to meetups and conferences that will further their growth.\n&ndash; Great benefits package, a competitive salary, and the opportunity to work for a company Fortune described as one of the top 100 places to work. Work/Life balance is held near and dear to our core values.</p>\n\n<p>Responsibilities:\n&ndash; Develop and maintain web-based software systems in Javascript utilizing industry standards and best practices.\n-Utilize Javascript to work with RESTful APIs and other backend services.\n&ndash; Be able to take a finished design, from a PSD or wireframes, and create a web-based software system using HTML, CSS, and Javascript.\n-Work with designers to create wireframes and assist in the prototyping of the design.\n-Ability to think critically and communicate effectively.\n&ndash; Be comfortable interacting with clients and scope project requirements.\n&ndash; Keep stakeholders apprised of project status.\n&ndash; Perform other job related duties.</p>\n\n<p>Qualifications</p>\n\n<p>REQUIREMENTS\n&ndash; A willingness to learn, teach, and make a lasting impression.\n&ndash; At least 3 years experience working with Javascript, with a strong understanding of JavaScript fundamentals&mdash; not just jQuery.\n&ndash; Experience working with APIs, either integrating a third-party API or developing your own\n&ndash; Experience with JS frameworks like Backbone preferred\n&ndash; 3 years experience working with HTML/CSS, particularly taking a design mock and turning it into clean, hand-coded HTML and CSS\n&ndash; Familiarity with HTML5 and CSS3\n&ndash; Familiarity with Git or other distributed version control system\n&ndash; Some experience with a backend scripting language. We use Ruby, but will accept PHP, Python, Smalltalk, etc.\n&ndash; Experience with MongoDB, CouchDB or other Document store a plus.\n&ndash; Familiarity with Test Driven Development, preferably RSpec and Cucumber, and Jasmin a plus\n&ndash; A link to online portfolio or GitHub profile strongly preferred\n&ndash; Past contributions to Open Source Projects or maintaining your own project are a huge plus.</p>\n",
    "how_to_apply": "<p>To be considered for this position, please follow the link below to the American Express Career website and submit an application;</p>\n\n<p><a href=\"http://jobs.americanexpress.com/job/New-York-Web-Developer-Job-NY/2464881/\">http://jobs.americanexpress.com/job/New-York-Web-Developer-Job-NY/2464881/</a></p>\n",
    "company": "American Express Publishing",
    "company_url": null,
    "company_logo": null,
    "url": "http://jobs.github.com/positions/c4ddc64c-8734-11e2-8438-81ad52db3ef6"
  },
  {
    "id": "f1d252ac-869f-11e2-801f-86ee7b2aee9b",
    "created_at": "Wed Mar 06 20:54:59 UTC 2013",
    "title": "Software Engineer/Graphics Developer",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>WHO WE ARE: We are a group of passionate engineers, scientists, entrepreneurs, and thinkers from some of the best academic and commercial groups worldwide. We have come together to create solutions that significantly benefit mankind by pushing the boundaries of knowledge and ability. Our clients include many large pharmaceutical companies, and our investors are fellow technology visionaries such as Bill Gates.</p>\n\n<p>WHO YOU ARE: You&rsquo;re a CS superstar. You know how to make a computer do exactly what you want. You&rsquo;re looking to make a noticeable impact. You like autonomy and owning a project through all steps of the development process, from prototype to deployment. You work mostly independently, but appreciate collaborating with other great engineers on difficult problems. While you&rsquo;re focused on quality, you know how to balance the perfect solution against getting things done.</p>\n\n<p>THE POSITION: We&rsquo;re developing a software platform that allows scientists to apply the power of physics-based simulations in order to inform and accelerate drug discovery. You&rsquo;ll design, develop, and maintain our graphical user interface, graphical molecular display, and related visualization tools. Development is on Linux, Windows, and Mac; current software development involves C++, C, Qt, Python, and OpenGL.</p>\n\n<p>Required:</p>\n\n<p>-Strong proven experience in graphical user interface design and development, C++, and object-oriented software design\n-Ability to meaningfully contribute to and maintain a large C++ code base\n-Excellent verbal and written communication skills\n-Ability to work and communicate effectively in a distributed work environment</p>\n\n<p>Strongly Preferred:</p>\n\n<p>-At least three years of commercial software development experience\n-BS/MS in computer science or software engineering, or equivalent experience\n-Development experience with Qt\n-Interest in scientific GUI development\n-Recent, modern (GLSL) OpenGL experience</p>\n\n<p>Benefits include medical, dental, 401(k), flexible spending account, 3+ weeks vacation, tuition reimbursement, and a flexible work schedule.</p>\n\n<p>Schrödinger, Inc. is an equal opportunity employer.</p>\n",
    "how_to_apply": "<p><a href=\"http://ch.tbe.taleo.net/CH02/ats/careers/requisition.jsp?org=SCHRODINGER&cws=1&rid=14\">http://ch.tbe.taleo.net/CH02/ats/careers/requisition.jsp?org=SCHRODINGER&amp;cws=1&amp;rid=14</a></p>\n",
    "company": "Schrödinger",
    "company_url": "http://www.schrodinger.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/f1d252ac-869f-11e2-801f-86ee7b2aee9b"
  },
  {
    "id": "7a51c568-84f2-11e2-9946-bdac067cb77c",
    "created_at": "Mon Mar 04 17:40:19 UTC 2013",
    "title": "Infrastructure Engineer, Schrödinger",
    "location": "New York",
    "type": "Full Time",
    "description": "<p>What we do: We&rsquo;re developing a software platform to allow scientists to leverage the power of physics-based simulations through all stages of the pharmaceutical and biotech drug discovery process. Basically, we&rsquo;re making software that will improve the lives of millions of people. Check out this short video featuring our fearless leader, Scott Becker: <a href=\"http://vimeo.com/49879101\">http://vimeo.com/49879101</a></p>\n\n<p>Who we are: We are passionate engineers, entrepreneurs, and thinkers. Our team consists of alumni of great engineering companies (e.g. Google/Microsoft) and startups, but all of them have made the decision to work on something with significant human impact. Our clients include many large pharmaceutical companies and our investors are fellow technology visionaries, including Bill Gates (who invested $20 million in the company in December!).</p>\n\n<p>As an Infrastructure Engineer, you will have the opportunity to improve the development speed and quality of our enterprise drug discovery platform. Your primary responsibility will be to work with the development engineering team to create new tools to build, test, deploy, and scale new versions of our platform (test harnesses, deployment automation tools, and monitoring systems). These systems explore and validate the functional correctness, performance capabilities, and resource usage of our software, as well as their interaction with other Schrodinger systems and infrastructure. This role is primarily a computer science role and does not require a professional level of experience in physical science (chemistry, biology, or physics).</p>\n\n<p>Responsibilities:</p>\n\n<p>-Work with the development and site reliability teams to create new build, monitoring, and deployment tools</p>\n\n<p>-Build and maintain automated test harnesses make testing applications easier</p>\n\n<p>-Conduct research on emerging technologies.</p>\n\n<p>-Analyze complicated software systems and design strategies to test them.</p>\n\n<p>-Train and mentor other team members.</p>\n\n<p>-Think outside the box / be highly creative</p>\n\n<p>-Be willing to learn new technologies</p>\n\n<p>-Ask smart questions</p>\n\n<p>Minimum Requirements:</p>\n\n<p>-B.S. in Computer Science, Computational Chemistry, Computational Biology, Engineering or related field</p>\n\n<p>-Excellent coding skill: You have built maintainable production tools</p>\n\n<p>-3 years of relevant work experience: including development, sys admin, and/or test automation experience.</p>\n\n<p>-Knowledge of the unix operating system</p>\n\n<p>-Enthusiasm for solving interesting problems and a willingness to learn</p>\n\n<p>-Experience with source control (GIT, SVN, etc)</p>\n\n<p>-Extensive knowledge of open source technologies</p>\n\n<p>-Self-motivated and reliable</p>\n\n<p>Pluses:</p>\n\n<p>-Experience working with Amazon EC2</p>\n\n<p>-Experience testing web applications</p>\n\n<p>-Experience with large scale distributed computing (MapReduce, Hadoop, Distributed Computing)</p>\n\n<p>-Science minor or independent interest (chemistry, physics, biology, or related)</p>\n",
    "how_to_apply": "<p>Please email your resume to jonathan.draxton@schrodinger.com.</p>\n",
    "company": "Schrödinger",
    "company_url": "https://www.schrodinger.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/7a51c568-84f2-11e2-9946-bdac067cb77c"
  },
  {
    "id": "6d649b3a-84e5-11e2-93f1-609dc8f839de",
    "created_at": "Mon Mar 04 16:07:56 UTC 2013",
    "title": "iOS Engineer - Paper By FiftyThree",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<h2>Hello, we are FiftyThree.</h2>\n\n<p>We make stuff. Beautiful, practical, meaningful stuff.\nWe make what we love.\nWe love what we do.</p>\n\n<p>Since we launched Paper for iOS in March of 2012, it has been downloaded more than <strong>7 million times</strong>.  In December, Apple named us the 2012 <strong>App of the Year</strong> on iPad.  But Paper is just the beginning for us; we’re hard at work on what’s next.  We&rsquo;re building teams in New York and Seattle to take up the challenge.</p>\n\n<p>We’re looking for iOS app developers (but we’d also love to talk to web devs, backend devs, and designers).  </p>\n\n<h2>About The Role</h2>\n\n<ul>\n<li>Love creating beautiful user experiences?  We’re a design-driven company, and you’ll have the opportunity to work closely with world-class designers.  In the last year, Paper has won numerous design awards including the Apple Design Award, IxDA, AIGA, and Crunchie.</li>\n<li>Enjoy a technical challenge? Interesting problems abound.</li>\n<li>Want to have an impact?  We’re small but growing quickly.  You’ll help shape the company’s future.</li>\n<li>We’re a startup but we’re on solid financial ground.  We offer competitive salary, benefits, and equity.<br></li>\n<li>This role will be based in our NYC office.  No remote, but we’ll help with relocation. H1B transfers only.</li>\n</ul>\n\n<h2>Who We’re Looking For</h2>\n\n<p>Great products begin with great people. This is who we strive to be:</p>\n\n<ul>\n<li><strong>Well-rounded</strong> We develop products at the intersection of art and science. It&rsquo;s great to have depth, but breadth is essential.</li>\n<li><strong>Collaborative</strong> Harmonious products reflect the teams that build them. The ability to work across disciplines and make others better is a must.</li>\n<li><strong>Makers</strong> We place a high value on the quality of our products and the process of making them. The joy of making is its own reward. We consistently set a higher bar.</li>\n<li><strong>Respectful</strong> Creativity flourishes in open, accepting environments. Respect and kindness towards members of the team and our customers is an absolute requirement.</li>\n<li><strong>Experimental</strong> We don&rsquo;t shy away from risks and experimentation. We embrace new thinking and technologies and always consider multiple ways of solving problems.</li>\n</ul>\n\n<p>If the above sounds like you, or if you think you&rsquo;d be a great addition to our team nonetheless, send us a note at <strong>jobs@fiftythree.com</strong>.  We look forward to hearing from you.</p>\n\n<h2>More About Us</h2>\n\n<ul>\n<li><a href=\"http://fiftythree.com\">http://fiftythree.com</a></li>\n<li>Have a look at what our users are up to: <a href=\"http://madewithpaper.fiftythree.com/\">http://madewithpaper.fiftythree.com/</a></li>\n<li>See Paper in action: <a href=\"http://vimeo.com/37254322\">http://vimeo.com/37254322</a>, <a href=\"http://vimeo.com/49329724\">http://vimeo.com/49329724</a>, <a href=\"http://vimeo.com/52316073\">http://vimeo.com/52316073</a></li>\n</ul>\n",
    "how_to_apply": "<p>Write us at jobs@fiftythree.com</p>\n\n<p>Please include a cover letter and your resume.   We&rsquo;d also love to see any past work you&rsquo;ve done (especially apps), your github account, etc.</p>\n",
    "company": "FiftyThree, Inc.",
    "company_url": "http://fiftythree.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a206560c-84f5-11e2-8408-848f19c353ae.png",
    "url": "http://jobs.github.com/positions/6d649b3a-84e5-11e2-93f1-609dc8f839de"
  },
  {
    "id": "244daf32-82dc-11e2-9488-7dd9b7a49fb8",
    "created_at": "Sat Mar 02 01:55:33 UTC 2013",
    "title": "Senior Front End Developer",
    "location": "New York City",
    "type": "Full Time",
    "description": "<p>For more then a decade Sweden Unlimited has been providing interactive solutions for numerous clients in the fashion industry. We take pride on evolving our client’s brands and translating their unique position to online. A boutique agency specializing in e-commerce, Sweden Unlimited’s dedicated team has worked with many brands to create new online business. We have been there through every aspect to integrate, educate and facilitate their digital and creative needs. Sweden is looking towards the future to cultivate and propel the exciting and ever-changing landscape of interactive fashion.  Our clients include: Lanvin, Michael Kors, Urban Outfitters, The Row, Jason Wu, and GrandLife Hotels.</p>\n\n<p>We’re currently looking for a Senior Front End Developer that’s passionate about creating beautiful experiences and interactions using the latest front end technologies. The ideal candidate will have a solid understanding of design, interaction and usability, while also having the front end chops to create rich new experiences. </p>\n\n<p>Primary Responsibilities:</p>\n\n<ul>\n<li>Work closely with our design and tech teams to create engaging, next level products</li>\n<li>Create clean, semantic markup inline with current best practices</li>\n<li>Create elegant and performant client-side application code</li>\n<li>Implement design layouts in code to the pixel and for various platforms and browsers</li>\n<li>Define and lead best practices for front end development</li>\n</ul>\n\n<p>Required Skills:</p>\n\n<ul>\n<li>Strong command of web standards, CSS-based design, cross-browser compatibility</li>\n<li>Expert knowledge of object-oriented Javascript</li>\n<li>Experience with modern client-side scripting frameworks (Backbone, Ember, Angular, Coffeescript)</li>\n<li>Experience with modern CSS/styling frameworks (Less, Sass, Foundation)</li>\n<li>Expertise in modern typography best-practices</li>\n<li>Experience integrating with CMS and MVC web frameworks (Wordpress, Rails, Django)</li>\n<li>Intermediate experience with Adobe Creative Suite</li>\n</ul>\n\n<p>Desired Skills:</p>\n\n<ul>\n<li>Responsive design strategies and tactics</li>\n<li>SEO, Semantic markup, Microformats</li>\n<li>Advanced experience with Adobe Creative Suite, especially Illustrator</li>\n<li>Experience with modern version control (git, bitbucket)</li>\n<li>Agile methodologies like Scrum, Kanban etc..</li>\n<li>Photography post-production and/or video editing</li>\n<li>Strong interest in fashion, design or art.</li>\n</ul>\n",
    "how_to_apply": "<p>Application Requirements:\nIf you’re interested in joining the Sweden Unlimited team, send your resume / portfolio / github to: jobs-dev@swedenunlimited.com. NO RECRUITERS.</p>\n",
    "company": "Sweden Unlimited",
    "company_url": "http://swedenunlimited.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/1ea117fe-82dc-11e2-997e-037b11a74f51.png",
    "url": "http://jobs.github.com/positions/244daf32-82dc-11e2-9488-7dd9b7a49fb8"
  },
  {
    "id": "9ef00b7e-82bc-11e2-847f-ed26981d6c90",
    "created_at": "Fri Mar 01 22:10:25 UTC 2013",
    "title": "Senior Ruby Engineer | Awesome NYC Startup",
    "location": "New York",
    "type": "Full Time",
    "description": "<p><strong>About us:</strong></p>\n\n<p>PINCHme is a funded startup based in SOHO, NYC, which is set to become a household name across the country. Working with the world’s biggest consumer brands, we’re about to revolutionize the way people try new products…for free!.\nThis an amazing opportunity to help build and lead an engineering team at one of New York’s most promising start-ups. You’ll have the chance to play a pivotal role in development of a product from the ground-up and build a platform that is set to change an industry. </p>\n\n<p><strong>About you:</strong></p>\n\n<ul>\n<li>You have strong Rails expertise. We are looking for a gun!</li>\n<li>You thrive on creating elegant, efficient code yet have a strong passion for product design.</li>\n<li>You have experience working on high traffic transaction websites.  You understand the need to cache and how to optimise your code.</li>\n<li>Testing is part of your ethos. You write tests before you code and you are as passionate about writing good tests as you are about writing good code.</li>\n<li>You thrive in an agile environment – you know about Kanban.  Working with index cards and markers is your kind of office.  You love to work with software like Pivotal Tracker and you wouldn’t have it any other way. You’re conformable working closely with the product team and present alternatives to help guide more efficient development.</li>\n<li>You loving building things just for the fun of it. You’ve worked on consumer-facing apps and projects, have probably participated in hackathons, and maybe have a few articles or a blog about tech under your belt.</li>\n<li>We’re not too fussed about qualifications – if you have a degree that’s great, but either way you’re an expert!</li>\n</ul>\n\n<p>We are currently working with one of America’s best engineering agencies and it will be your responsibility to help us build our engineering team and transition into full ownership of the product. </p>\n\n<p><strong>Here’s some of the techy stuff we want to see:</strong></p>\n\n<ul>\n<li>HTML 4 &amp; 5</li>\n<li>Ruby 1.8 &ndash; 1.9/Rails 2.3 – 3</li>\n<li>JavaScript Frameworks (jQuery, CoffeeScript, Backbone)</li>\n<li>CSS 2 &amp; 3</li>\n<li>WebKit/Modern HTML+JS+CSS development</li>\n<li>PostgreSQL/Strong SQL skills</li>\n<li>Exposure to Amazon Web Services </li>\n<li>DevOps understanding.  Continuous delivery tools (Capistrano, Puppet/Chef) (Nice to have)</li>\n</ul>\n\n<p><strong>What we have to offer:</strong></p>\n\n<ul>\n<li>Compensation and benefits as awesome as you are</li>\n<li>Chance to grab a front row seat in a “rocket-ship” tech startup</li>\n<li>Opportunity to shape a new and exciting product</li>\n<li>A fun, vibrant workplace right on Broadway</li>\n</ul>\n\n<p>If that sounds like something you’re ready for, apply now!</p>\n\n<p>Must be authorized to work in the United States on a full-time basis for any employer.</p>\n",
    "how_to_apply": "<p>Email your resume to careers@pinchme.com</p>\n",
    "company": "PINCHme",
    "company_url": "http://pinchme.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a814bd4a-822f-11e2-9890-43ace13cbbe6.png",
    "url": "http://jobs.github.com/positions/9ef00b7e-82bc-11e2-847f-ed26981d6c90"
  },
  {
    "id": "22bc65d4-82a3-11e2-86b7-ff5783b7a817",
    "created_at": "Fri Mar 01 19:08:29 UTC 2013",
    "title": "Engineer at Energy Management Startup",
    "location": "Brooklyn, NY",
    "type": "Full Time",
    "description": "<p>EnergyHub is looking to add another passionate programmer to our team. You will have the opportunity to work on all aspects of the software: the back end distributed system, database storage, web and mobile applications, and the tools that we use.</p>\n\n<p>The ideal candidate:</p>\n\n<ul>\n<li>Is fluent in a modern programming language (almost any!).</li>\n<li>Knows their way around computers because they like knowing how things work.</li>\n<li>Plays around with embedded systems.</li>\n<li>Has built cool web or mobile applications.</li>\n<li>Has worked on a distributed, fault-tolerant, and scalable system.</li>\n<li>Agrees that &ldquo;Danger Zone&rdquo; by Kenny Loggins is the perfect soundtrack for releases, even though releasing software is easier than flying a fighter jet.</li>\n</ul>\n\n<p>EnergyHub is a Brooklyn-based startup located in an old factory near the scenic Gowanus Canal. We provide a cloud-hosted software platform for managing energy use in homes and small businesses. Together, our partners have sold over 100,000 EnergyHub-powered devices, and we will be managing 1 million devices in the next few years. EnergyHub offers great benefits, including: company-paid medical, dental, and vision benefits for you and your dependents, 401(k), stock options, paid vacations, delicious snacks, foosball, and more!</p>\n\n<p>As a team, we:</p>\n\n<ul>\n<li>Like the JVM, but love Python.</li>\n<li>Juggle data using the right tool for the job &mdash; SQL, NoSQL, or even a mixture of pandas and ipython.</li>\n<li>Scale horizontally.</li>\n<li>Keep a clean house using dev tools such as git and Jenkins.</li>\n<li>Are open to trying out new technologies, languages, and ideas.</li>\n</ul>\n",
    "how_to_apply": "<p>To apply, send your resumé and a brief note to jobs@energyhub.com.</p>\n",
    "company": "EnergyHub",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/dc7c79ce-82a2-11e2-8f06-d431a6498499.png",
    "url": "http://jobs.github.com/positions/22bc65d4-82a3-11e2-86b7-ff5783b7a817"
  },
  {
    "id": "429b9cfe-819e-11e2-99b9-11d4400eaf5e",
    "created_at": "Thu Feb 28 12:08:54 UTC 2013",
    "title": "Developer",
    "location": "New York",
    "type": "Full Time",
    "description": "<p>Do you love writing software? Do you learn new languages and work on side projects in your spare time? We should talk.</p>\n\n<p>At Mint Digital we are obsessed with building great software and learning as much as we can about the craft while we do.</p>\n\n<p>Our core beliefs:</p>\n\n<p><strong>Creating software should be a fun process</strong>. We’ve been working in Rails for years, and it’s been a blast. Every year, we head off somewhere remote, split into teams and compete for a week in building something cool. We use whatever tools will help us solve the problem at hand in the best possible way. Our current toolset includes: Ruby, Rails, HTML5, JS, CoffeeScript, PostGres, MySQL, Chef, Redis, Resque, Ubuntu, nginx, git and many more.</p>\n\n<p><strong>But at the same time it’s serious business</strong>. Although we’re having fun, we take our responsibilities to our customers and to the products we create for them very seriously. This is true both collectively, and individually.</p>\n\n<p><strong>A software developer must constantly be learning</strong>. If you’re still doing things the same way you did two years ago, or even last year, then you’re in danger of letting the industry pass you by. All of our staff are sent to industry conferences, and provided with training on a regular basis. Although we’re known primarily as a Ruby / Rails shop, we’re constantly playing with new tools (Scala, Erlang, Node, Django and Objective-C have been recent obsessions for various Mint devs).</p>\n\n<p>If you are excited by the sound of this opportunity, we&rsquo;d love to talk. We are interested in both junior &amp; senior applicants with skills in either front or back end (or both!) and value highly people with an aptitude and desire to learn. If you think you’d fit in here, please drop us a line. We look forward to speaking with you.</p>\n\n<p>Please check our <a href=\"http://mintdigital.com/jobs\">jobs</a> page for further details.</p>\n",
    "how_to_apply": "<p>Get in touch: jobs@mintdigital.com</p>\n",
    "company": "Mint Digital",
    "company_url": "http://mintdigital.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e84bf53c-819d-11e2-989f-cc688e14c1e7.png",
    "url": "http://jobs.github.com/positions/429b9cfe-819e-11e2-99b9-11d4400eaf5e"
  },
  {
    "id": "35f82204-806a-11e2-91e5-cf0a95a932c8",
    "created_at": "Tue Feb 26 23:14:39 UTC 2013",
    "title": "Ruby on Rails(RoR)/Agile Developer",
    "location": "Midtown, New York",
    "type": "Full Time",
    "description": "<p><em>Scrum/XP/Agile team in midtown Manhattan looking for an experienced Rubyist or experienced Java/C# developer interested in learning Ruby.</em></p>\n\n<p>We are an established, six developer Scrum/XP team. We have a dedicated scrum master and we collaborate closely with our product team.</p>\n\n<p>Our team contains experienced rails developers who pair program, extensively test and deploy predictably on a weekly iteration cycle. We emphasize work/life balance, sustainable pace and collaborative feature development in a collegial environment.</p>\n\n<p>Work entails creating and maintaining Ruby on Rails websites and other consumer digital products for Simon &amp; Schuster, a leading English Language trade publisher. Position reports directly to VP Engineering for Simon &amp; Schuster Digital. Simon &amp; Schuster is a women-run organization, an equal opportunity employer and a part of CBS Corporation.</p>\n\n<p>We mostly code in Ruby on Rails 3, Bootstrap, Sass, CoffeeScript, JavaScript, CSS, HTML with RSpec, Jasmine testing.</p>\n\n<p>Join a good team. Get a full-time job with benefits. Help us figure out the future of trade publishing. Gain access to Simon &amp; Schuster’s thousands of books through our employee physical and ebook programs.</p>\n\n<p>No recruiters please.</p>\n\n<p>Read the full posting and apply at: <a href=\"http://smsch.us/Xeq9JH\">http://smsch.us/Xeq9JH</a></p>\n",
    "how_to_apply": "<p>Read the full posting and apply at: <a href=\"http://smsch.us/Xeq9JH\">http://smsch.us/Xeq9JH</a></p>\n",
    "company": "Simon & Schuster",
    "company_url": "http://www.simonandschuster.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/c803d72a-8069-11e2-9ecb-46edfca32a64.png",
    "url": "http://jobs.github.com/positions/35f82204-806a-11e2-91e5-cf0a95a932c8"
  },
  {
    "id": "366d1612-7f71-11e2-8f24-05728b5e9c41",
    "created_at": "Mon Feb 25 17:32:40 UTC 2013",
    "title": "Interactive Developer (Mid-Senior Level)",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>Hello, We&rsquo;re Code and Theory!</p>\n\n<p>We work hard, with sincere passion in creating things that evoke positive emotions, disrupt the status quo and in the process &ndash; win lots of awards. We&rsquo;re somewhat mysterious; with a unique chemistry of passionate engineers that evangelize, develop and launch groundbreaking experiences used by millions of people every day.</p>\n\n<p>Our work is a culmination of technologists and designers collaborating to create something special. It’s what makes us different, and ultimately why our clients are the most exciting. From the fashion sensibilities of Vogue to the industry-shaping TechCrunch (and all those in-between), our projects are the results of great passionate people working to make a difference.</p>\n\n<p>Awesome Work with Sincere Humility\nOur engineering team covers a lot of technology stacks. Whether you are driven by building applications using PHP, Ruby on Rails, an HTML5 / CSS3 / jQuery warrior, or obsessed with build-and-deploy automation, we&rsquo;re looking for the best. People who are smart, creative, up for any challenge, and hungry for more, to make Code and Theory an environment that brings out the best in all of us.</p>\n\n<p>Code and Theory Benefits\nIn addition to working with the smart and passionate people that make up the Code and Theory family, you also get the perks. There&rsquo;s the usual &ndash; 401k, excellent health and dental coverage, life insurance and long-term disability. Then there are the extras, some random, mostly awesome – bagel Mondays, summer Fridays, stocked candy jar, Crunch and Equinox Gym Partnerships, discounted AMC movie tickets, field trips, game nights and team outings.</p>\n\n<p>The Workspace\nCubicles? Er, no. Located in the heart of Soho (dangerously close to the Apple Store) our office has an open layout with lots of sun and big windows, and an overall unique workspace. </p>\n\n<p>Required\nAwesome front-end chops, you know HTML, CSS and jQuery like Sean Connery knowsh Bond, yet you still want to do much, much more with HTML5, CSS3 and JavaScript\nYou have plenty of OOP experience and feel at home on the LAMP stack\nOptimization techniques and object-oriented JavaScript are common sense and common knowledge to you\nYou see the mobile browser as a close friend to the desktop browser\nYou have worked with the Facebook platform and other popular web service APIs\nYou’re passionate about learning more, and are excited to collaborate with other team members across UX, Visual Design and Engineering\nYou’re used to participating in the requirements-gathering process for new projects\nYou can debug legacy code and other application configuration issues and do so with gusto\nYou’ll actively participate in the evolution of our technologies and technology practices, occasionally pitch new technologies that you believe in, and participate in workshops to learn new skills</p>\n\n<p>Desirable\nExperience with Drupal, Expression Engine, Wordpress and other open source content management platforms\nMobile development &ndash; Titanium, PhoneGap, Game Salad, Unity, Objective-C, Java are all tasty\nPrevious participation in &ndash; or hungry to learn about &ndash; Test Driven Development and Behavior Driven Development methodologies\nExperience with application frameworks like CodeIgniter</p>\n\n<p>Talk to us if…\nYou know you can become a great part of a great team\nYou can see UX, design and technology working together to make awesome pie\nYou want to make a difference, and will work to do just that\nYou like building great experiences that disrupt industries and the status quo\nYou like to constantly evolve, evangelize the best practices to do so, and work with an enthusiastic team that is excited to come along for the ride</p>\n",
    "how_to_apply": "<p>Email resume to ny.careers@codeandtheory.com</p>\n",
    "company": "Code and Theory",
    "company_url": "http://www.codeandtheory.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/24769262-7f71-11e2-9de4-bb7730039943.jpg",
    "url": "http://jobs.github.com/positions/366d1612-7f71-11e2-8f24-05728b5e9c41"
  },
  {
    "id": "ba7ac9de-7d2a-11e2-923c-baddf608818e",
    "created_at": "Fri Feb 22 20:02:40 UTC 2013",
    "title": "Java/Python Tech Lead - Combosaurus ",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>We&rsquo;re <a href=\"http://www.okcupidlabs.com/#ny\">OkCupid Labs</a>, the mad scientist cousin of OkCupid.com. We&rsquo;re 10 employees, split into small product teams, working fast, having fun, and shipping often.</p>\n\n<p><strong>What do we do here?</strong></p>\n\n<p>Awesome stuff. Stuff like:</p>\n\n<ul>\n<li>Coming up with brand new ideas for how to connect people in love, life, work, and beyond</li>\n<li>Building MVP’s to test our awesome ideas</li>\n<li>Scrapping ideas that aren’t awesome anymore and starting over on new things</li>\n<li>Taking our products to market, scaling them, refining them, and watching the cash roll in (or at least we hope!)</li>\n</ul>\n\n<p><strong>What does a Tech Lead do?</strong></p>\n\n<ul>\n<li>Have a hand in our existing products and help us dream up new ideas</li>\n<li>Program in Java/Python and help manage the systems our products run on</li>\n<li>Work through significant scaling challenges</li>\n<li>Contribute to our culture of healthy skepticism</li>\n<li>Creatively look for better ways to connect people and their emotions online</li>\n</ul>\n\n<p><strong>We&rsquo;re looking for:</strong></p>\n\n<ul>\n<li>Someone great who can lead a team of excellent Java &amp; Python devs</li>\n<li>The kind of programming foundation that only comes from a love of programming</li>\n<li>A curious mind that experiments with things simply because it&rsquo;s neat</li>\n<li>Real understanding of the web and how it&rsquo;s designed at the fundamental layers</li>\n<li>Experience and opinions on modern database technologies</li>\n<li>A healthy dose of skepticism towards the design of secure systems</li>\n</ul>\n\n<p><strong>It&rsquo;s neat if you are also:</strong></p>\n\n<ul>\n<li>Into programming enough to do it in your spare time</li>\n<li>A fan of open source</li>\n</ul>\n\n<p><strong>What to you get in return?</strong></p>\n\n<ul>\n<li>Competitive salary</li>\n<li>Medical, Dental, Vision, Pet Insurance for your armadillo, and 401k</li>\n<li>A serious equity stake in every business the Labs creates</li>\n<li>Machine, gear, and environment of your choice</li>\n<li>Free meals, probably as much beer as you want</li>\n</ul>\n\n<p><strong>Want to join our team?</strong></p>\n\n<p>Send us your resume and a link to your code samples (Github, site links, etc.).</p>\n",
    "how_to_apply": "<p>Send us you resume and some samples of your work (github, etc):</p>\n\n<p>ann@okcupidlabs.com</p>\n",
    "company": "OkCupid Labs",
    "company_url": "http://www.okcupilabs.com/#ny",
    "company_logo": "http://github-jobs.s3.amazonaws.com/28b2fdaa-7d2a-11e2-9966-593be39e7a61.jpg",
    "url": "http://jobs.github.com/positions/ba7ac9de-7d2a-11e2-923c-baddf608818e"
  },
  {
    "id": "f1419daa-7c51-11e2-9a5e-23c4ad5c5acb",
    "created_at": "Thu Feb 21 18:12:32 UTC 2013",
    "title": "Frontend Developer",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p><em>YOU DREAM ABOUT HTML5, SASS, JQUERY AND YOU ALREADY VIEWED THE SOURCE OF OUR WEBSITE</em></p>\n\n<p>VHX is a platform for independent artists to sell their work directly to fans. We love movies and technology and we are growing! We are looking for an experienced Rails developer who wants to dig into developing with scale and depth. You must be located in NYC and enjoy collaborating in a small team with strong communication skills and ideas. </p>\n\n<p><strong>We need an experienced front-end engineer who:</strong><br>\n&ndash; Loves learning new technology<br>\n&ndash; Has an eye for great design<br>\n&ndash; Can work autonomously<br>\n&ndash; Thrives with clients and criticism<br>\n&ndash; Thinks jokes are funny   </p>\n\n<p><strong>Tools we use:</strong><br>\n&ndash; Javascript/jQuery<br>\n&ndash; Mustache<br>\n&ndash; Jasmine<br>\n&ndash; HTML5<br>\n&ndash; CSS/SASS<br>\n&ndash; Ruby on Rails<br>\n&ndash; Asana<br>\n&ndash; TeamGantt<br>\n&ndash; GitHub<br>\n&ndash; Hipchat emojis<br>\n&ndash; Bulleit Bourbon   </p>\n\n<p>About VHX: We love movies. We believe artists should make more money from their work.\nWe have already released a bunch of awesome films, from Aziz Ansari to Indie Game to Sound City to This American Life. We are invested in every client. We are young and growing quickly.  We have fun code. We hang out together in DUMBO. </p>\n\n<p>Stock options and competitive benefits package, including full health and Sherpaa. Full petting access to the VHX canine office mascot.</p>\n",
    "how_to_apply": "<p>Email us at jobs@vhx.tv!</p>\n",
    "company": "VHX",
    "company_url": "http://vhx.tv",
    "company_logo": "http://github-jobs.s3.amazonaws.com/c208d30a-7b9d-11e2-945d-e8875374cbdc.png",
    "url": "http://jobs.github.com/positions/f1419daa-7c51-11e2-9a5e-23c4ad5c5acb"
  },
  {
    "id": "9b710442-7c47-11e2-80fe-da5aba7679d5",
    "created_at": "Thu Feb 21 16:57:01 UTC 2013",
    "title": "Front-end Developer",
    "location": "New York City",
    "type": "Full Time",
    "description": "<p>Group SJR needs a front-end developer (or generalist) to join our small digital team &mdash; someone with a good sense of design who loves problem-solving across different platforms. </p>\n\n<p>You should be comfortable working on end-to-end site development, particularly with Wordpress. You should be excited about working on all levels of development projects, collaborating closely with designers and content creators (photo, video, etc), and providing creative input from a development perspective. </p>\n\n<p>We don&rsquo;t expect you to know everything right away, but we do expect you to be creative, self-sufficient, and an extremely fast learner with a decent foundation in code. We work in a fast-paced environment with lots of different projects, so that should be appealing to you. There will be some less exciting things to do &mdash; it&rsquo;s a job, after all &mdash; but there&rsquo;s a huge space for creative projects as well. Ideally, we&rsquo;re looking for someone who can find a great balance between those things. </p>\n\n<p>You should have a good portfolio, a GitHub profile, and solid code examples. </p>\n\n<p><strong>DETAILS</strong></p>\n\n<ul>\n<li>Full time position with benefits</li>\n<li>401k after one year</li>\n<li>1-3 Years Experience</li>\n</ul>\n\n<p><strong>SKILLS</strong></p>\n\n<p>You should be feel very comfortable with: </p>\n\n<ul>\n<li>HTML5 + CSS3</li>\n<li>Javascript + jQuery</li>\n<li>Wordpress</li>\n<li>Responsive design principles and development frameworks</li>\n</ul>\n\n<p>It would awesome if you were also familiar with or want to make yourself familiar with some of these:</p>\n\n<ul>\n<li>Node.js</li>\n<li>Ruby/Sinatra/Padrino</li>\n<li>Processing</li>\n<li>openFrameworks/Cinder</li>\n<li>HAML</li>\n<li>Less</li>\n<li>Coffescript</li>\n<li>Bootstrap</li>\n<li>Phonegap</li>\n<li>Mobile dev (iOS and/or Android)</li>\n<li>Saas eCommerce</li>\n<li>Data visualization</li>\n</ul>\n\n<p><strong>ABOUT GROUP SJR</strong></p>\n\n<p>Group SJR leads strategic digital and interactive campaigns and projects for Fortune 100 global brands, start-ups and issues-based organizations. Capabilities include: strategic consulting; content creation, design, photo, web and mobile development / production; qualitative and quantitative research and analytics. </p>\n\n<p>You won&rsquo;t find much about us on our site as we don&rsquo;t believe in publicly taking credit for our client&rsquo;s successes. We&rsquo;re a rapidly growing agency of about 50 professionals in the Flatiron &mdash; come join us.</p>\n",
    "how_to_apply": "<p>Email your portfolio links + resume to dev@groupsjr.com.</p>\n",
    "company": "Group SJR",
    "company_url": "http://groupsjr.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/dd43034e-7c46-11e2-89b3-42a4dc1f22c8.png",
    "url": "http://jobs.github.com/positions/9b710442-7c47-11e2-80fe-da5aba7679d5"
  },
  {
    "id": "74969a06-7c1c-11e2-88c8-75e1855ae460",
    "created_at": "Thu Feb 21 11:47:43 UTC 2013",
    "title": "QA Engineer",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>We are looking for a full-time, in-house QA Engineer to join the team and help keep our release rate high.</p>\n\n<p>As the QA engineer, you will find new and creative ways to optimize our continuous integration platform. You will wield the power of veto &ndash; as far as deploying goes &ndash; on the work of our product team. And you&rsquo;ll use our bots to do the basic chores while you strategize how best to increase the pace and quality of our releases.</p>\n\n<p>In short, this is a unique opportunity for you to make your job easier, every day.</p>\n\n<p>We&rsquo;re still small (~30) and are looking for people who want to work in an environment where you get to really make a difference in what the product and company become.</p>\n\n<p><strong>Must Haves</strong></p>\n\n<ul>\n<li>Experience with Selenium, Watir or Sahi</li>\n<li>Can program in one language</li>\n<li>Hacking spirit</li>\n<li>Lazy enough to automate his daily job</li>\n</ul>\n\n<p><strong>Nice to Haves</strong></p>\n\n<ul>\n<li>Experience with Selenium WebDriver or Watir WebDriver</li>\n<li>Python coding experience</li>\n<li>SQL knowledge for data integrity</li>\n<li>Understanding of what a RESTful API is</li>\n<li>Send us a bug you&rsquo;ve found on the website ;)</li>\n</ul>\n",
    "how_to_apply": "<p>Send your resume and Github profile to <a href=\"mailto:jobs@percolate.com\">jobs@percolate.com</a> or <a href=\"http://percolate.com/about/jobs/14\">apply here</a></p>\n",
    "company": "Percolate",
    "company_url": "http://percolate.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ffecc8ec-7c1b-11e2-8835-d7e8943fc359.png",
    "url": "http://jobs.github.com/positions/74969a06-7c1c-11e2-88c8-75e1855ae460"
  },
  {
    "id": "7da3eefa-7ba9-11e2-8c38-573ac947209f",
    "created_at": "Wed Feb 20 22:09:28 UTC 2013",
    "title": "Ruby on Rails Developer",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<h1>SolveBigProblems @HandybookHQ.</h1>\n\n<p>The way people buy services today is broken. Why shouldn’t it be as easy to book services as it is to book a car on Uber or buy a book on Amazon? Where is the platform that allows users to book services with one click?</p>\n\n<p>Handybook is an online platform that lets users instantly book a cleaner or handyman. In less than 60 seconds your booking will be confirmed and one of our pre-approved, background-checked providers will show up on time and complete your job. It’s that simple.  </p>\n\n<p>Handybook started in April of 2012 and has raised over $2 million of investment from VCs including Highland Capital Partners and General Catalyst.</p>\n\n<p>What You Enjoy:</p>\n\n<ul>\n<li>Being part of an awesome team while having freedom with your own responsibilities</li>\n<li>Evaluating new technologies to be used within our main products</li>\n<li>Contributing your own ideas and helping mentor new recruits</li>\n</ul>\n\n<p>You&rsquo;re excited to work on one or more of the following:</p>\n\n<ul>\n<li>Our new Ruby on Rails web and API backend</li>\n<li>Our new iPhone app</li>\n<li>Our existing PHP code base</li>\n<li>The frontend to our web app</li>\n</ul>\n\n<p>What We Offer:</p>\n\n<ul>\n<li>A key position that offers you a tangible impact on the company’s success.</li>\n<li>An office in the heart of Manhattan, steps away from Madison Square Garden</li>\n<li>Free lunches, snacks, and a fully stocked drink cabinet</li>\n<li>Dynamic and friendly working atmosphere in a successful international team.</li>\n<li>Opportunity to grow and learn from an excellent team of advisors and work directly with our VP of Engineering</li>\n<li>Social events with the team including happy hours, bowling, and more</li>\n</ul>\n",
    "how_to_apply": "<p>E-mail jobs@handybook.com with your resume and a brief explanation of why you would be a good fit for this position. Please include links to any work you can show.</p>\n",
    "company": "Handybook",
    "company_url": "http://www.handybook.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/2e64da66-7ba9-11e2-927a-68a468d54f30.png",
    "url": "http://jobs.github.com/positions/7da3eefa-7ba9-11e2-8c38-573ac947209f"
  },
  {
    "id": "3b7109bc-7b7e-11e2-82c8-c158cbaace14",
    "created_at": "Wed Feb 20 16:54:47 UTC 2013",
    "title": "Senior Front-end Software Engineer",
    "location": "New York, NY, US",
    "type": "Full Time",
    "description": "<p>Backbase is hiring | Senior Front-end Software Engineer         We are Backbase         Financials want the most compelling digital experience for their customers, but in today&rsquo;s Web 2.0 World, legacy banking systems struggle to keep pace. Backbase helps financials to create a new user experience layer on top of their existing systems that combines content, data and functionality from different underlying systems into fresh customer dialogs. Backbase&rsquo;s white-label Bank 2.0 Portal software enables financials to deliver next-generation online banking services across multiple devices (including tablets and smart phones), and turns their online channel into a true customer experience platform. Backbase helps financial organizations to re-use their existing systems, and enter the era of &lsquo;Engagement Banking&rsquo; where they manage and optimize their online customer experiences and grow revenue and loyalty.         Backbase is a Visionary software vendor listed the Gartner Magic Quadrant for Horizontal Portal Software, founded in 2003 and privately held. Working for Backbase you have the opportunity to live in two of the most culturally vibrant cities in the world: Amsterdam (headquarters) or New York City (North American office). At Backbase we have a special set of values that make us who we are. We hire and evaluate our employees on these values. It is our company DNA.             We get things done                 We do more with less                   We believe in great design                 We are easy to do business with                    Together we make it work           The team         As Senior Front-end Software Engineer  you are part of the Backbase team in New York. You will report to the GM New York.      The goal        As Senior Front-end Software Engineer you will collaborate with strategic clients in the design, development and evolution of mission critical web applications. During our pilot and implementation projects you will be part of a highly skilled multidisciplinary team. You work closely with our clients, architects and backend consultants to implement complex and modern web applications based on Object Oriented architecture and applying solid programming patterns without loosing the creativity aspect of the work in hand. Our frontend consultants do a wide variety of work including Ajax training and best practices consulting, frontend technical design, and application development on high quality standards.            Backbase uses implementation partners when doing full implementations of the product for clients. In your role and as member of Expert Services you are the expert frontend consultant responsible for the guidance and coaching of our partners' frontend consultants.       Most project work is done in the Backbase office; however, some project executions are done at the client site. Therefore, since our product is sold worldwide, you sometimes have to travel and work abroad for periods ranging from a few days up to a few weeks.      Your profile        The ideal candidate for this challenging position as a Senior Front-end Software Engineer within Backbase will fit the following profile:               4-10  years experience in a similar role;                  An expert on the required skills; (X)HMTL, CSS, JavaScript, DOM, XML, XPath and XSLT;                  Knowledge of JavaScript libraries like jQuery, and Mootools  is a plus;                    Object Oriented Javascript development is a plus;                  Master in cross-browser compatibility issues;                  Good understanding of Object Oriented architecture;                    Some experience in Java/.Net/PHP is a plus;                    Experience with performance tuning, re-usability and maintainability of Ajax software;                 Quality driven &amp; pixel-perfect focused;                    Experience with automated testing of front-end deliverables is a plus (e.g. Selenium);                 Understanding and experience with service oriented architecture and design patterns is a plus;                 Able to mentor junior colleagues and guide customers;                  Ability to present to audience.            The offer       Backbase offers a comprehensive Benefits Package through our Human Resources partner TriNet. Employee benefits includes a substantial number of Health Care policy options; Dental and Vision Insurance; Short &amp; Long Term Disability Insurance; Life Insurance; 4% Matching 401k plan; Vacation, Holiday, and Sick Paid time off. Backbase coverage is substantial while in addition Backbase, through TriNet, is able to provide the employees with a wide variety of offerings for the employee to custom design benefits that work best for themselves and their families.      Backbase offers you a challenging job in an informal and ambitious environment where personal development is highly valued. This is all within a successful, young and growing organization with a matching company spirit.      Next steps      If this job appeals to you and you think you are up for the challenge, please use the apply button on this page.For more information please contact Brian Stothers via e-mail: brianst(at)backbase.com      </p>\n",
    "how_to_apply": "<p><a href=\"http://www.applytracking.com/track.aspx/3Z0rR\">http://www.applytracking.com/track.aspx/3Z0rR</a></p>\n",
    "company": "Backbase",
    "company_url": null,
    "company_logo": null,
    "url": "http://jobs.github.com/positions/3b7109bc-7b7e-11e2-82c8-c158cbaace14"
  },
  {
    "id": "f00c3096-7b7d-11e2-9a29-a3b8fed30229",
    "created_at": "Wed Feb 20 16:52:40 UTC 2013",
    "title": "Front-end Engineer Mobile",
    "location": "New York, NY, US",
    "type": "Full Time",
    "description": "<p>Backbase is hiring | Front-end Engineer Mobile      We are Backbase         Financials want the most compelling digital experience for their customers, but in today&rsquo;s Web 2.0 World, legacy banking systems struggle to keep pace. Backbase helps financials to create a new user experience layer on top of their existing systems that combines content, data and functionality from different underlying systems into fresh customer dialogs. Backbase&rsquo;s white-label Bank 2.0 Portal software enables financials to deliver next-generation online banking services across multiple devices (including tablets and smart phones), and turns their online channel into a true customer experience platform. Backbase helps financial organizations to re-use their existing systems, and enter the era of &lsquo;Engagement Banking&rsquo; where they manage and optimize their online customer experiences and grow revenue and loyalty.         Backbase is a Visionary software vendor listed the Gartner Magic Quadrant for Horizontal Portal Software, founded in 2003 and privately held. Working for Backbase you have the opportunity to live in two of the most culturally vibrant cities in the world: Amsterdam (headquarters) or New York City (North American office).      The team        As Frontend Engineer Mobile you are part of the R&amp;D department of Backbase in New York. R&amp;D uses Scrum as development process, along with elements from XP and TDD. The Scrum teams are highly self-responsible which gives you a lot of freedom as well as responsibility to deliver functionality as a team.       Backbase has strong ambitions to become a major player in its field and provides a challenging, professional, informal working environment.      The goal        As a Front-end Engineer Mobile  you will be working on our flagship portal product, using the latest mobile and cross-platform technologies on iOS, Android, Windows Mobile and Blackberry.You will be joining a highly skilled team of both Front-end Engineers that provides lots of opportunities to both demonstrate and improve your skills.      Your profile        The ideal candidate for this challenging and demanding job will fit the following profile:            Broad architecture and development skills;                Devoted to keep on learning, understanding and using new mobile (cross platform) technologies;                Experience with mobile development on one or multiple of the main mobile platforms; iOS, Android, Windows8 and Blackberry;                Experience with web development using (X)HMTL, CSS, JavaScript, DOM, XML, XPath and XSLT;                 Knowledge of JavaScript libraries like jQuery, SenchaTouch, jQmob, or Backbone is preferred;              Object Oriented Javascript development is a plus;                 Experience with mobile development frameworks like PhoneGap/Cordova, App Inventor, DroidDraw, Appcelerator or AML is preferred;               Experience with optimizing performance and data transfer;                 Experience with Scrum and Test-Driven-Development is preferred;               Quality driven &amp; pixel-perfect focused;               Understanding and experience on architecture design patterns;                 Able to mentor (junior) colleagues;               You have good communicative skills in English; Another European Language is an asset;                 You are proficient at expressing your professional opinion but listen to and value other contributions at the same time;              Experience within a (international) product organization is an asset.            The offer       Backbase offers a comprehensive Benefits Package through our Human Resources partner TriNet. Employee benefits includes a substantial number of Health Care policy options; Dental and Vision Insurance; Short &amp; Long Term Disability Insurance; Life Insurance; 4% Matching 401k plan; Vacation, Holiday, and Sick Paid time off. Backbase coverage is substantial while in addition Backbase, through TriNet, is able to provide the employees with a wide variety of offerings for the employee to custom design benefits that work best for themselves and their families.       Backbase offers you a challenging job in an informal and ambitious environment where personal development is highly valued. This is all within a successful, young and growing organization with a matching company spirit.      Next steps      If this job appeals to you and you think you are up for the challenge, please use the apply button on this page.        For more information please contact Brian Stothers via e-mail: brianst(at)backbase.com   </p>\n",
    "how_to_apply": "<p><a href=\"http://www.applytracking.com/track.aspx/3Z0pf\">http://www.applytracking.com/track.aspx/3Z0pf</a></p>\n",
    "company": "Backbase",
    "company_url": null,
    "company_logo": null,
    "url": "http://jobs.github.com/positions/f00c3096-7b7d-11e2-9a29-a3b8fed30229"
  },
  {
    "id": "357a2ddc-7a24-11e2-9f04-0a16b784674e",
    "created_at": "Mon Feb 18 23:38:25 UTC 2013",
    "title": "Frontend Engineer",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>Do you want to work on a product that truly improves people’s lives? Do you want to work on a small team with exceptionally talented people? We’re looking for an experienced Frontend Engineer to join the OkCupid Product Team in New York City.</p>\n\n<p>As a Frontend Engineer, you’ll be responsible for building the interface that millions use to meet new people. You’ll play a key role in developing and optimizing new and existing features on the OkCupid site.</p>\n\n<p><strong>What you’ll do</strong></p>\n\n<ul>\n<li>Work closely with designers, software engineers, and other developers</li>\n<li>Build features from the design stage through to production</li>\n<li>Write straightforward, maintainable code in HTML, CSS, and Javascript</li>\n</ul>\n\n<p><strong>What you need to land an interview</strong></p>\n\n<ul>\n<li>Experience working in a collaborative development environment (if you’re from another high-traffic site, even better!)</li>\n<li>Serious knowledge of Javascript</li>\n<li>You dream in CSS and you know all of the tricks (the IE-saving ones too)</li>\n<li>Basic familiarity with the UNIX command line</li>\n<li>Experience with SVN or Git</li>\n</ul>\n\n<p><strong>What we’re expecting</strong></p>\n\n<ul>\n<li>You use OkCupid (or have in the past) and love the product</li>\n<li>You’re a highly technical problem-solver, but you appreciate and understand great design</li>\n<li>You love building great products that millions of people can use</li>\n<li>You’re meticulous, but still able to iterate quickly</li>\n<li>You have a portfolio (which you probably built yourself) of projects you’ve worked on (some of which are self-started)</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"http://okcupid.theresumator.com/apply/A4ms9f/Frontend-Engineer.html?source=Github\">http://okcupid.theresumator.com/apply/A4ms9f/Frontend-Engineer.html?source=Github</a></p>\n",
    "company": "OkCupid",
    "company_url": "http://www.okcupid.com/careers/we-are-hiring",
    "company_logo": "http://github-jobs.s3.amazonaws.com/1183ae6c-7a24-11e2-8e3d-f45b1f5f0f5f.png",
    "url": "http://jobs.github.com/positions/357a2ddc-7a24-11e2-9f04-0a16b784674e"
  },
  {
    "id": "436a025a-79fc-11e2-9482-6131a6b2ee54",
    "created_at": "Mon Feb 18 18:54:39 UTC 2013",
    "title": "Web Developer",
    "location": "Stamford, CT",
    "type": "Full Time",
    "description": "<p>You have an opportunity to become a ground-floor member of an experienced team of software innovators and investment professionals dedicated to harnessing technology and social media to transform the capital-raising process for growth-stage companies. I-Bankers Direct is seeking a web developer ready to help drive the ongoing development of the I-Bankers Direct web-portal. Our goal is not simply to adopt and implement best practices within our portal. Our goal is for the I-Bankers Direct portal to raise the bar in the equity crowdfunding industry—to set a new standard for excellence and optimization of the user experience.</p>\n\n<p>COMPANY OVERVIEW: </p>\n\n<p>I-Bankers Direct (www.ibankersdirect.com) operates an online funding &amp; investment portal that provides accredited investors and venture groups with direct access to equity investment opportunities in dynamic, growth-stage companies. Traditional methods for capital-raising typically allow companies to interact with, at most, a few dozen institutions or individual investors during a &ldquo;road show&rdquo;. Our platform provides accredited investors with instant, 24/7 access to information and offering documents about each company raising capital, automatically incorporating the power of a large, socially-networked audience into the process. I-Bankers Direct has harnessed the power of the Internet—in combination with the experience our team has gained helping companies access more than $6 billion in capital over the past 18 years—to create a platform where accredited individual investors, venture capitalists and private equity investors can efficiently connect with and invest in early-stage companies. </p>\n\n<p>I-Bankers Direct: Serious Crowdfunding for Serious Investors™. Join our team and become part of an exciting new era in investment banking.</p>\n\n<p>WHO YOU ARE &amp; WHAT YOU&rsquo;VE DONE:</p>\n\n<p>•Five+ years experience in web development preferred. </p>\n\n<p>•Proficiency in HTML, CSS, PHP and MySQL (Expertise in Adobe Creative Suite a plus). </p>\n\n<p>•Hands-on, self-directed individual. </p>\n\n<p>•Experience developing socially-networked web platforms preferred. </p>\n\n<p>•Dedicated to developing dazzling solutions to complex technical challenges. </p>\n\n<p>•Degree from a leading university. </p>\n\n<p>•Comfortable in a faced-paced environment.</p>\n\n<p>•Must be currently authorized to work in the US and reside locally.</p>\n\n<p>WHAT YOU&rsquo;LL BE DOING:</p>\n\n<p>•Work really hard to solve complex problems and high-fiving when you do. </p>\n\n<p>•Treat our website like a product and build it to wow visitors. </p>\n\n<p>•Research &amp; implement new toolsets and frameworks to optimize efficiency of site development. </p>\n\n<p>•Collaborate with members of senior management to develop and implement portal upgrades that enhance user experience.  </p>\n\n<p>•Conduct design reviews, code reviews, technical reviews and phase transition reviews.  </p>\n\n<p>•Manage site traffic analytics. </p>\n\n<p>•Assist in analyzing business opportunities and managing development budgets. </p>\n\n<p>•Work with branding and creative teams.</p>\n\n<p>COMPENSATION &amp; BENEFITS:</p>\n\n<p>Base Salary, Bonus, Stock Options</p>\n",
    "how_to_apply": "<p>For consideration, please send a cover letter AND resume to careers@ibankersdirect.com</p>\n",
    "company": "I-Bankers Direct",
    "company_url": "https://www.ibankersdirect.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/8dc1da72-79fb-11e2-9750-9cb34d5a27ed.jpg",
    "url": "http://jobs.github.com/positions/436a025a-79fc-11e2-9482-6131a6b2ee54"
  },
  {
    "id": "f0f398c2-773c-11e2-9b5c-e2c94ca70c5d",
    "created_at": "Fri Feb 15 18:38:10 UTC 2013",
    "title": "Senior Front End Software Engineer",
    "location": "Manhattan, NY",
    "type": "Full Time",
    "description": "<p>As a senior front end engineer, you love building responsive, well-composed client side applications. You love working with great UI/UX designers to create elegant and simple experiences that solve problems and delight millions of users. You have a knack for putting yourself in the shoes of the user. You know how to make things fast and feel snappy. Your experience and ability to understand the design goals of the business and to translate them into an elegant technical solution is what you love to do. You have the ability to see the bigger picture and communicate it to others.</p>\n\n<p>You’re excited to work on the homepage redesign. You want to A/B test alternative solutions to see which one works better. You can’t wait to start working on a new site feature, or building a widget or figuring out how to get viral growth through a clever social media integration (and you like figuring out how to hack Facebook’s API when the documentation is wrong). You love the challenge of working at a startup with a mission, and seeing the results of your efforts every day in user traffic and behavior.</p>\n\n<p><strong>Requirements</strong></p>\n\n<ul>\n<li>Experience with Responsive Web Design (desktop, mobile and tablet devices)</li>\n<li><p>Proficient with Javascript and frameworks such as jQuery and jQueryUI.  You will be the primary driver of our client side module and should have experience with widget development or done some complex mash-up work.</p></li>\n<li><p>Excellent social media integration skills, including Facebook and Twitter</p></li>\n<li><p>Fluent in semantic HTML5 and CSS3, and comfortable with LESS preprocessors</p></li>\n<li><p>Extensive experience writing elegant, readable, maintainable HTML and CSS</p></li>\n<li><p>Strong working knowledge of DOM and AJAX</p></li>\n<li><p>Good working knowledge of server side coding (PHP)</p></li>\n<li><p>Experience with cloud architecture (Amazon Web Services), caching, performance optimization and SEO</p></li>\n<li><p>Solid knowledge of web standards, cross-browser compatibility, and building in accessibility from the ground up</p></li>\n<li><p>Experience working in open-source LAMP environment, including SSH</p></li>\n<li><p>Solid understanding of web technologies such as REST, HTTP, JSON</p></li>\n<li><p>Comfortable debugging browser problems with firebug and similar tools.</p></li>\n<li><p>Solid understanding of testing concepts and practices (unit testing, test automation, …)</p></li>\n<li><p>Understands version control, preferably Git</p></li>\n<li><p>Communicate effectively with all internal business related team members.</p></li>\n<li><p>Ideal candidate should have experience creating highly trafficked websites</p></li>\n<li><p>Identify opportunities for process improvement and make constructive suggestions for change.</p></li>\n</ul>\n\n<p><strong>Environment</strong></p>\n\n<ul>\n<li><p>Agile development</p></li>\n<li><p>Working on multiple concurrent projects in a fast paced environment</p></li>\n<li><p>Close to the user – customer feedback drives iteration</p></li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume to jobs@webthriftstore.com</p>\n",
    "company": "WebThriftStore",
    "company_url": "http://www.webthriftstore.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e3fd4fb0-773b-11e2-9950-76e1ce9f6c4b.jpg",
    "url": "http://jobs.github.com/positions/f0f398c2-773c-11e2-9b5c-e2c94ca70c5d"
  },
  {
    "id": "d01c1a10-7616-11e2-9591-bb1224c69d3d",
    "created_at": "Wed Feb 13 19:52:50 UTC 2013",
    "title": "Java Engineer, Analytics Innovation Practice",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p><strong>Company Description</strong></p>\n\n<p>Altman Vilandrie &amp; Company (AV&amp;Co.) is a boutique strategy consulting group that focuses exclusively on the telecommunications, media and related technology and investor sectors. As one of the only pure play communications and media strategy consulting groups in North America, we assist operating companies and financial groups in fast, high-impact, confident decision making. We enable clients to\nseize new opportunities, improve business performance, and increase shareholder value within complex and converging industries.</p>\n\n<p><strong>The Analytics Innovation Practice</strong></p>\n\n<p>At Altman Vilandrie &amp; Company, we pride ourselves in delivering highly actionable results to our clients. The Analytics Innovation Practice extends this value by building meaningful, sustainable tools and products that can be incorporated into the real-time business practices of our clients. We see opportunity in complex problems, and we use that motivation to create and deliver solutions that redefine the intersection of strategy, action, and data.</p>\n\n<p><strong>Duties and Responsibilities</strong></p>\n\n<p>As a Java Engineer working in the Analytics Innovation Practice, you will work with a dynamic, cross-disciplinary team to design and build sustainable, high-performance software applications that typically involve the processing and display of large sets of data. You should have a strong command over the design and analysis of algorithms, a working knowledge of fundamental data structures, and the ability to design and deploy solid, secure, cloud-based hosting solutions.</p>\n\n<p>The AIP team uses the Agile methodology, so familiarity with Story- and Test- Driven Development, Continuous Integration, and related tools is appreciated.</p>\n\n<p><strong>Skills and Qualifications</strong></p>\n\n<ul>\n<li>Strong knowledge of Java</li>\n<li>Familiarity with Python</li>\n<li>Working knowledge of HTML, jQuery, CSS</li>\n<li>Knowledge of Hadoop Map/Reduce (preferred but not necessary)</li>\n<li>Knowledge of JUnit</li>\n<li>Strong command over common database engines (MySQL, Postgres, PostgresGIS)</li>\n<li>Strong knowledge of Object-Oriented Design</li>\n<li>Strong knowledge of algorithm design and analysis</li>\n<li>Strong knowledge of fundamental data structures</li>\n<li>Demonstrate performance of professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations</li>\n<li>Familiarity with Git/Git Workflow</li>\n<li>Experience working with Agile methodology</li>\n<li>Familiarity with Story- or Test- Driven Development</li>\n<li>Bachelor’s Degree in Computer Science or related field, or 3+ years relevant work experience</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume to chathaway@altvil.com</p>\n",
    "company": "Altman Vilandrie & Co.",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/c70f7bb0-7616-11e2-8a51-cc0a51f7cbff.jpg",
    "url": "http://jobs.github.com/positions/d01c1a10-7616-11e2-9591-bb1224c69d3d"
  },
  {
    "id": "f4b2328c-749b-11e2-8146-0822641b9774",
    "created_at": "Mon Feb 11 22:40:35 UTC 2013",
    "title": "Senior Quality Assurance (QA) / Automation Engineering Lead",
    "location": "New York City",
    "type": "Full Time",
    "description": "<h1>About us</h1>\n\n<p>Sailthru is a technology company that specializes in digital brand experiences and communications. Its Smart Data™ solution is leading a major shift in how companies engage with their customers through the automatic analysis of big data sets to generate informed, personalized communications across all digital channels. Smart Data delivers higher conversion rates and revenues for clients including AOL/Huffington Post, The Newsweek/Daily Beast Company, Business Insider, The New York Post, Thrillist, Fab.com, Totsy and OpenSky. Founded in 2008 by Neil Capel and Ian White and headquartered in New York, Saitilthru has experienced tremendous growth rooted in the company’s understanding that Smart Data starts with Smart People.  Culture at Sailthru is as unique and innovative as  it’s technology and filled with individuals who are engaged, informed and empowered to build, learn and grow daily. </p>\n\n<h1>The Role</h1>\n\n<p>Sailthru is looking for an experienced leader in Quality (QA) Assurance/Automation Engineering who will play a critical role in taking Sailthru’s QA Team to the next level. Sailthru’s Senior QA / Automation Engineer will help increase the technical knowledge of the team, specifically focusing on Automation, including functionality, usability, load/performance, regression as well as backend knowledge. This is a key role on Sailthru’s QA Team with responsibility for actively developing our automation framework, maintaining test environments and providing product development and feedback.</p>\n\n<h1>About You</h1>\n\n<p>This role is perfect for a self-starter with a passion for testing products, automating everything and driving a strategic vision and direction for test framework. In addition you are an agile, self-motivated and product oriented engineering leader with an ambition to motivate and run a team. Specifically, you have:\n* 7+ years of web application testing experience\n* Experience using Python for test automation\n* Experience with functional, load, and performance testing including extensive knowledge of * * * Selenium Webdriver\n* Experience with Linux, Bash scripting\n* Familiarity with testing databases\n* Excellent verbal and written communication skills\n* Involvement in open source projects is a plus</p>\n",
    "how_to_apply": "<p><a href=\"https://hire.jobvite.com/j/?aj=oog7Wfwr&s=GitHub_Jobs\">https://hire.jobvite.com/j/?aj=oog7Wfwr&amp;s=GitHub_Jobs</a></p>\n",
    "company": "Sailthru",
    "company_url": "http://www.sailthru.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/de0ff8a2-749b-11e2-8338-440135a194c5.png",
    "url": "http://jobs.github.com/positions/f4b2328c-749b-11e2-8146-0822641b9774"
  },
  {
    "id": "b09605a2-749a-11e2-9b96-1b4145df83f8",
    "created_at": "Mon Feb 11 22:31:38 UTC 2013",
    "title": "Lead Mobile Engineer",
    "location": "New York City",
    "type": "Full Time",
    "description": "<h1>About us</h1>\n\n<p>Sailthru is a technology company that specializes in digital brand experiences and communications. Its Smart Data™ solution is leading a major shift in how companies engage with their customers through the automatic analysis of big data sets to generate informed, personalized communications across all digital channels. Smart Data delivers higher conversion rates and revenues for clients including AOL/Huffington Post, The Newsweek/Daily Beast Company, Business Insider, The New York Post, Thrillist, Fab.com, Totsy and OpenSky. Founded in 2008 by Neil Capel and Ian White and headquartered in New York, Saitilthru has experienced tremendous growth rooted in the company’s understanding that Smart Data starts with Smart People.  Culture at Sailthru is as unique and innovative as  it’s technology and filled with individuals who are engaged, informed and empowered to build, learn and grow daily. </p>\n\n<h1>The Role</h1>\n\n<p>Sailthru&rsquo;s  Lead Mobile Engineer has the opportunity to build out Sailthru&rsquo;s mobile product platform as the company continues to scale.  Specifically, Sailthru&rsquo;s Lead Mobile Engineer role will:\n* Have ownership and responsibility for successfully integrating push notifications into the Sailthru system (writing the SDK to make it all happen).\n* Establish the foundation for Sailthru&rsquo;s growth in the mobile space.\n* Design and successfully implement Sailthru&rsquo;s open-source mobile SDK.\n* Architect cross-platform push notification framework.\n* Join a top-tier engineering team at a high growth technology company.\n* In addition, Sailthru&rsquo;s Lead Mobile Engineer has significant growth and role development potential in building out Sailthru&rsquo;s internal mobile applications for Development and Client Success/Support workflow. This is an excellent opportunity for someone passionate about mobile development and excited about making a true impact at a scaling technology company.</p>\n\n<h1>About You</h1>\n\n<p>Sailthru&rsquo;s Lead Mobile Engineer role is perfect for a self-starter with a passion for mobile development and cutting edge push-notification frameworks.  In addition, you also have:\n* Cross-platform knowledge in iOS and Android required.\n* Product-driven focus with ability to balance business and technical requirements.\n* Familiarity with the growing Windows Phone market is a plus.\n* Enjoys the challenge of rapid development cycles within an active work environment.\n* Ability to help scale a mobile team long-term, with an upfront ability to do the work yourself.\n* HTML5 experience would be great as this person could be an asset to our UX/UI team as we look to take our UI to the mobile screen.</p>\n",
    "how_to_apply": "<p><a href=\"https://hire.jobvite.com/j/?aj=oNr6Wfw0&s=GitHub_Jobs\">https://hire.jobvite.com/j/?aj=oNr6Wfw0&amp;s=GitHub_Jobs</a></p>\n",
    "company": "Sailthru",
    "company_url": "http://www.sailthru.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/65a5ef58-749a-11e2-84d0-fd8d0c73d7d2.png",
    "url": "http://jobs.github.com/positions/b09605a2-749a-11e2-9b96-1b4145df83f8"
  },
  {
    "id": "8b90763e-7468-11e2-86bc-b43f31efc1d0",
    "created_at": "Mon Feb 11 16:35:05 UTC 2013",
    "title": "Web Analyst",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p>Group SJR needs a numbers guy.  Or girl.  Someone who dreams in spreadsheets.  Who can turn complex data into interesting stories….</p>\n\n<p>Here’s what we need:</p>\n\n<p>The Web Analyst will be responsible for establishing and running the analytics reporting tools that will deliver insights, analyses and recommendations to shape the day-to-day business and long-term growth of Group SJR’s digital content properties.  This role will require leveraging cross-channel analytics to develop custom performance dashboards that tell the “story” behind the numbers—transforming data into actionable business intelligence.</p>\n\n<p>The ideal candidate is highly analytical and explorative, demonstrating curiosity and proactively seeking out new platforms and trends while responding efficiently to changing demands and circumstances.  Working in close partnership with client account teams, the Web Analyst will report up through our Research &amp; Insights team.  This role is a big opportunity for the right self-starter to help shape a quickly growing part of the company.</p>\n\n<p>Full benefits and competitive salary.</p>\n\n<p>RESPONSIBILITIES\n*         Create custom dashboards to enhance targeting and allocate resources more efficiently\n*         Develop processes and systems that standardize and automate reporting\n*         Work with different teams to implement new tracking and tailor reporting specific to needs\n*         Lead tagging to ensure accuracy of tracking and measurement\n*         Guide recommendations that improve audience engagement, conversions and traffic\n*         Deliver monthly analytics reports and findings for digital content properties\n*         Participate in all site builds, consulting on backend design for SEO/SEM\n*         Conceptualize design direction for data visualization</p>\n\n<p>QUALIFICATIONS\n*         Bachelor’s degree\n*         2+ years of relevant experience preferred\n*         Google &amp; Yahoo! Analytics\n*         Advanced methodologies (e.g. advanced segmentation, custom implementations)\n*         SEO and SEM\n*         Strong understanding of A/B and multivariate testing\n*         Fluent in scripting languages (e.g. Python, Ruby)\n*         Relational databases (e.g. Oracle, MySQL, PostgreSQL)\n*         Microsoft Office Suite, including Excel modeling with VBA\n*         Proven ability to communicate insights to a non-technical audience\n*         Familiarity with promoted discovery platforms (e.g. Outbrain, Disqus)</p>\n\n<p>BONUS\n*         GitHub profile\n*         Experience with Google APIs\n*         Web development frameworks (e.g. Ruby on Rails, Django) \n*         Visualization frameworks (e.g. D3.js)</p>\n\n<p>Group SJR is a digital media agency that specializes in designing and running online content strategies for major brands. We help corporations and major advocacy organizations share their unique knowledge and insights across digital platforms. It&rsquo;s a lively place to work &hellip; smart team, good community, top-tier client roster.</p>\n",
    "how_to_apply": "<p>resume@groupsjr.com</p>\n",
    "company": "Group SJR",
    "company_url": "http://groupsjr.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/dd43034e-7c46-11e2-89b3-42a4dc1f22c8.png",
    "url": "http://jobs.github.com/positions/8b90763e-7468-11e2-86bc-b43f31efc1d0"
  },
  {
    "id": "77c81bb2-73f9-11e2-9b2b-bda4b87056ea",
    "created_at": "Mon Feb 11 03:16:47 UTC 2013",
    "title": "Senior Software Engineer / Developer",
    "location": "New York, NY, US",
    "type": "Full Time",
    "description": "<p>Senior Software Engineer &ndash; TapCommerce  Are you interested in cutting edge mobile &amp; tablet technologies? Are you a talented engineer looking for a constantly moving challenge? Do you like working with a small agile/scrum team on a big product attacking a huge market?  If yes, then we would love to talk to you.  TapCommerce is venture-backed mobile technology company, based in the Union Square neighborhood of New York City. We are helping leading brands to sell more to their customers on smartphones and tablets. Our goal is to make mobile shopping an amazing experience, from discovery to purchase.   TapCommerce is looking for Senior Software Engineers to join us full time. We have many very interesting technical problems to solve in areas like big data, machine learning, distributed computing and high availability. You&rsquo;ll gain exposure to cutting edge technologies and have a chance to make a huge impact on a growing business. More about what we&rsquo;re looking for:    &#9679;      Strong programming skills, particularly when it comes to Java    &#9679;      The ability to quickly pick up and run with new technologies &#9679;      Experience in developing server-side technologies like APIs and web apps &#9679;      Knowledge of, or a keen interest in, the mobile technology space &#9679;      Strong communication skills  &#9679;      B.S. in Computer Science or related field   Nice to have skills, but not required skills: &#9679;      Big data technologies like Hadoop, MapReduce, Hive and NoSQL &#9679;      Building, architecting, or developing high-volume, low-latency systems   &#9679;      Experience or interest in data mining and machine learning   &#9679;      AWS or other cloud server platforms  &#9679;      Experience administering Linux servers   &#9679;      Willingness to lose gracefully at ping-pong Some good reasons to apply    &#9679;      Competitive base salary + health benefits in a growing company   &#9679;      Excellent equity options in a venture-backed start-up    &#9679;      Ample budget for whatever hardware setup you want    &#9679;      Great work environment in a beautiful loft in Union Square   &#9679;      Regular company outings, off-sites, and team-building events &#9679;      Generous amounts of free food and drink on-site TapCommerce is a tech start-up based in NYC in the Union Square neighborhood. We&rsquo;ve raised funding from awesome investors, and we are growing quickly.   If you made it this far, you&rsquo;re probably interested so send us a line and introduce yourself. Send over a cover letter, a copy of your resume, and links to any projects you&rsquo;ve done that you&rsquo;re proud of, and we&rsquo;ll be in touch.      </p>\n",
    "how_to_apply": "<p><a href=\"http://www.applytracking.com/track.aspx/3WlfR\">http://www.applytracking.com/track.aspx/3WlfR</a></p>\n",
    "company": "tapCommerce",
    "company_url": null,
    "company_logo": null,
    "url": "http://jobs.github.com/positions/77c81bb2-73f9-11e2-9b2b-bda4b87056ea"
  }
]